target/test-classes/xml/sws/maintainbundle/TC31983_request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sel="http://selfcare.telco.hsntech.com">
  <soapenv:Header/>
  <soapenv:Body>
    <sel:maintainBundleRequest>
      <sel:maintainBundleAction effective="TEMPORARY" acceptWarning="true">
        <sel:externalSystemId>NETCALL</sel:externalSystemId>
        <sel:accountNumber>$accountNumber$</sel:accountNumber>
        <sel:subscriptionNumber>$subscriptionNumber$</sel:subscriptionNumber>
        <sel:bundleActions>
          <sel:bundleAction actionType="ADD">
            <sel:group>FLEXCAP</sel:group>
            <sel:groupCode>SB-GRP-A</sel:groupCode>
            <sel:bundleCode>03000-SB-A</sel:bundleCode>
          </sel:bundleAction>
          <sel:bundleAction actionType="REMOVE">
            <sel:group>FLEXCAP</sel:group>
            <sel:groupCode>SB-GRP-A</sel:groupCode>
            <sel:bundleCode>02000-SB-A</sel:bundleCode>
          </sel:bundleAction>
        </sel:bundleActions>
      </sel:maintainBundleAction>
    </sel:maintainBundleRequest>
  </soapenv:Body>
</soapenv:Envelope>